//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
/*++

Copyright (c)  2010 - 2014 Intel Corporation. All rights reserved
This software and associated documentation (if any) is furnished
under a license and may only be used or copied in accordance
with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be
reproduced, stored in a retrieval system, or transmitted in any
form or by any means without the express written consent of
Intel Corporation.


Module Name:

  IioRegs.h

Abstract:

  IIO constants.

Revision History:

--*/

#ifndef _IIO_REGS_H_
#define _IIO_REGS_H_

#include <Token.h> // AptioV override
#include "PlatformHost.h"



#define PCI_PCIE_ADDR(Bus,Device,Function,Offset) \
  (((Offset) & 0xfff) | (((Function) & 0x07) << 12) | (((Device) & 0x1f) << 15) | (((Bus) & 0xff) << 20))

#define IIO_BUS_NUM                               0
#define MaxIIO                                    MAX_SOCKET
#ifndef MAX_CPU_SOCKET
#define MAX_CPU_SOCKET                            MaxIIO
#endif
#define MaxPortDevices                            4
#define NUMBER_PORTS_PER_SOCKET                   11

#define HECI1_DEV_NUM                             0x12
#define HECI1_FUNC_NUM                            0x00
#define HECI2_DEV_NUM                             0x12
#define HECI2_FUNC_NUM                            0x01

#define V_HECI_VID                                V_INTEL_VID
#define V_HECI1_DID_CLIENT                        0x3414    // HECI-1 Client SKU
#define V_HECI2_DID_CLIENT                        0x3415    // HECI-2 Client SKU
#define V_HECI1_DID_SERVER                        0x3434    // HECI-1 Server SKU
#define V_HECI2_DID_SERVER                        0x3435    // HECI-2 Server SKU

#define R_HECIMBAR                                0x10
#define R_FWSTATE                                 0x40
#define   B_CUR_STATE                               (BIT3 | BIT2 | BIT1 | BIT0)
#define     V_CUR_STATE_MEFW_HARDM_DISABLED           0x00
#define     V_CUR_STATE_MEFW_INITIALIZING             0x01
#define     V_CUR_STATE_MEFW_RECOVERY                 0x02
#define     V_CUR_STATE_MEFW_NPTM_ACTIVE              0x03
#define     V_CUR_STATE_MEFW_NPTM_INACTIVE            0x04
#define     V_CUR_STATE_MEFW_SOFTM_DISABLED           0x08
#define     V_CUR_STATE_MEFW_VALIDATION               0x0F

#define   B_ERR_CODE                                (BIT15 | BIT14 | BIT13 | BIT12)
#define     V_ERR_CORE_MEFW_NOERROR                   0x00
#define     V_ERR_CORE_MEFW_UNCATEGORIZED             0x01
#define     V_ERR_CORE_MEFW_DISABLED                  0x02
#define     V_ERR_CORE_MEFW_IMG_FAILURE               0x03

#define   B_EXT_STAT                                ( BIT31 | BIT30 | BIT29 | BIT28 | BIT27 | BIT26 | BIT25 | BIT24 | \
                                                      BIT23 | BIT22 | BIT21 | BIT20 | BIT19 | BIT18 | BIT17 | BIT16)

#define R_HIDM                                    0xA0

//
// ME-HECI MBAR registers
//
#define HECI_DEV                                  22
#define HECI_FUN                                  0
#define R_HECI_HOST_CB_WW                         0x00
#define R_HECI_HOST_H_CSR                         0x04
#define R_HECI_ME_CB_RW                           0x08
#define R_HECI_ME_CSR_HA                          0x0C
#define R_HECI_GEN_STS                            0x4C

//
// LBC commands and other defines
//
#define LBC_READ_COMMAND                            0x1
#define LBC_WRITE_COMMAND                           0x2
#define LBC_LN_SEL_MASK                             (0xFFFF << 11)
#define LOAD_BUS_ADDRESS_0                          0x2f
#define LOAD_BUS_ADDRESS_1                          0x38
#define LOAD_CTLE_SEL_2                             46
#define V_LANE_ERR_CTLE                             BIT8
#define B_CTLEOP_OFFSCAL                            (BIT6 | BIT5 | BIT4 | BIT3 | BIT2)
#define B_CTLEOP_RANGE                              (BIT1 | BIT0)
#define V_CTLEOP_RANGE_R0                           0x0
#define V_CTLEOP_RANGE_R2                           0x2
//
// Support Unions and structures for the purpose of data manipulation - Start
//
typedef struct {
    UINT32  CSIFEQSEL_STRAP:2;                    // 1:0
    UINT32  SMBUSID_STRAP:1;                      // 2
    UINT32  BMCINIT_STRAP:1;                      // 3
    UINT32  CSIBLCSEl_STRAP:1;                    // 4
    UINT32  PESBLCSEL_STRAP:1;                    // 5
    UINT32  DFX1n0_STRAP:2;                       // 7:6
    UINT32  DFX3n2_STRAP:2;                       // 9:8
    UINT32  PCIECFG_STRAP:6;                      // 15:10
    UINT32  DMIMODE_STRAP:1;                      // 16
    UINT32  LEGACYIOH_STRAP:1;                    // 17
    UINT32  TLS_STRAP:1;                          // 18 
    UINT32  ITPM_STRAP:1;                         // 19 
    UINT32  ISAFE_STRAP:1;                        // 20
    UINT32  ISSHIFT_STRAP:1;                      // 21
    UINT32  EARLYSHIFT_STRAP:1;                   // 22
    UINT32  DISPULTSO_STRAP:1;                    // 23
    UINT32  DCSMODE_STRAP:1;                      // 24
    UINT32  DUALIOH_STRAP:1;                      // 25
    UINT32  MP_STRAP:1;                           // 26
    UINT32  Reserved27_STRAP:1;                   // 27
    UINT32  NodeID2NodeID:1;                      // 29
    UINT32  CSINodeID3:1;                         // 28
    UINT32  Reserved31n30_STRAP:2;                // 31:30
  } IIOMISCSS_D20F0_BITS;

typedef union {
    IIOMISCSS_D20F0_BITS      Bits;
    UINT32                    Dword;
} IIOMISCSS_D20F0;

// Support Unions and structures for the purpose of data manipulation - End

#define PCI_EXPRESS_BASE_ADDRESS  ((VOID *) (UINTN) 0x80000000)
#endif
